In [1]:
import pandas as pd

In [3]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
births = [968, 155, 77, 578, 973]
custom = [1, 5, 25, 13, 23232]

BabyDataSet = list(zip(names, births))
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

df.head()

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [4]:
# columns information
df.dtypes

Names     object
Births     int64
dtype: object

In [5]:
# row information
df.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# column information
df.columns

Index(['Names', 'Births'], dtype='object')

In [7]:
# select column
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [8]:
# select index(row)
df[0:3]

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77

In [9]:
# 두 결과는 서로 형태가 다르게 보임
# 첫 번째는 시리즈라는 객체를 출력
# 두 번째는 데이터 프레임을 출력

In [10]:
df[df['Births']>100]

     Names  Births
0      Bob     968
1  Jessica     155
3     John     578
4      Mel     973

In [11]:
df['Births']>100

0     True
1     True
2    False
3     True
4     True
Name: Births, dtype: bool

In [12]:
# mean() 함수는 각 열들의 데이터 타입을 체크한 뒤, 
# 연산이 가능한 열의 평균값만을 반환
df.mean()

Births    550.2
dtype: float64

In [13]:
import numpy as np

In [14]:
arr1 = np.arange(15).reshape(3,5)
arr1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])